snlkuharlocal/src/DataProcessors/ЗагрузкаЛогов/ЗагрузкаЛогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаЛогов</name>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЖурналРегистрации/ЖурналРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналРегистрации</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изменения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияШапки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияТЧ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/Логи/Логи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Логи</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЛога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ЗагрузкаЛогов/ObjectModule.bsl
Перем БазаИсточник;

Функция ЗагрузитьОбъект(ИсточникЗаписьXML, ПриемникЧтениеXML, ИсточникОбъект)
	
	Попытка
		
		ИсточникЗаписьXML.УстановитьСтроку();
		БазаИсточник.ЗаписатьXML(ИсточникЗаписьXML, ИсточникОбъект);
		СтрокаXML		= ИсточникЗаписьXML.Закрыть();
		
		ПриемникЧтениеXML.УстановитьСтроку(СтрокаXML);
		ПриемникЧтениеXML.Прочитать();
		ПриемникОбъект	= ПрочитатьXML(ПриемникЧтениеXML);
		ПриемникОбъект.ОбменДанными.Загрузка = Истина;
		ПриемникОбъект.Записать();
		
	Исключение
		
		Сообщить("Исключение: " + ОписаниеОшибки());
		ПриемникОбъект	= Неопределено;
		
	КонецПопытки;
	
	Возврат ПриемникОбъект;
	
КонецФункции

Функция УстановитьСоединение_Ист()	
	#ЕСЛИ КЛИЕНТ ТОГДА
	Состояние("Установка соединения с источником.....");		
	#КОНЕЦЕСЛИ	
		
	СтрокаСоединения=Константы.СтрокаСоединенияСБазойЛогов.Получить();
	
	Если ПустаяСтрока(СтрокаСоединения) Тогда
		СообщитьОбОшибке("Не указаны параметры соединенеия с базой источником логов !");
		Возврат Ложь;	
	КонецЕсли;	
	
	Соединение_Ист = Новый COMОбъект("V81.COMConnector");
	СтрокаСоединения_Ист=СтрокаСоединения+"Usr="""+"Администратор"+""";Pwd="""+""+""";";
		
	Попытка				
		БазаИсточник	= Соединение_Ист.Connect(СтрокаСоединения_Ист);		
		Возврат Истина;
	Исключение                 		
		СообщитьОбОшибке("Ошибка установки соединения с базой источником ! "+ОписаниеОшибки());		
		Возврат Ложь;
	КонецПопытки;		
КонецФункции

Процедура ЗагрузитьЛоги() Экспорт
	Если НЕ Константы.БазаАрхиваЛогов.Получить() Тогда
		СообщитьОбОшибке("Данная база не является базой архива логов. Загрузка невозможна !");
		Возврат;
	КонецЕсли; 
	
	Если НЕ УстановитьСоединение_Ист() Тогда Возврат КонецЕсли; 
	
	Запрос=БазаИсточник.NewObject("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	День
	|ИЗ
	|	РегистрСведений.ЖурналРегистрации
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|УПОРЯДОЧИТЬ ПО День";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	ИсточникЗаписьXML	= БазаИсточник.NewObject("ЗаписьXML");	
	ПриемникЧтениеXML	= Новый ЧтениеXML;
	
	ВыборкаИст=Запрос.Выполнить().Выбрать();
	Пока ВыборкаИст.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();		
		Состояние("Загрузка: "+ВыборкаИст.День);
		#КОНЕЦЕСЛИ
		
		НЗ_Ист=БазаИсточник.РегистрыСведений.ЖурналРегистрации.СоздатьНаборЗаписей();
		НЗ_Ист.Отбор.День.Установить(ВыборкаИст.День,Истина);
		НЗ_Ист.Прочитать();			
		
		НЗ_Тек=ЗагрузитьОбъект(ИсточникЗаписьXML, ПриемникЧтениеXML, НЗ_Ист);
		
		НЗ_Тек.Записать();
		
		НЗ_Ист.Очистить();
		НЗ_Ист.Записать();
	КонецЦикла;	
	
	
	Запрос=БазаИсточник.NewObject("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	День
	|ИЗ
	|	РегистрСведений.Логи
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|УПОРЯДОЧИТЬ ПО День";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	ИсточникЗаписьXML	= БазаИсточник.NewObject("ЗаписьXML");	
	ПриемникЧтениеXML	= Новый ЧтениеXML;
	
	ВыборкаИст=Запрос.Выполнить().Выбрать();
	Пока ВыборкаИст.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		Состояние("Загрузка: "+ВыборкаИст.День);
		#КОНЕЦЕСЛИ
		
		НЗ_Ист=БазаИсточник.РегистрыСведений.Логи.СоздатьНаборЗаписей();
		НЗ_Ист.Отбор.День.Установить(ВыборкаИст.День,Истина);
		НЗ_Ист.Прочитать();			
		
		НЗ_Тек=ЗагрузитьОбъект(ИсточникЗаписьXML, ПриемникЧтениеXML, НЗ_Ист);
		
		НЗ_Тек.Записать();
		
		НЗ_Ист.Очистить();
		НЗ_Ист.Записать();
	КонецЦикла;	
КонецПроцедуры
